Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/pic32cx5109bz31032.h
/* CMSIS includes */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cxbz31.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CX5109BZ31032                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adchs.h"
#include "component/arb.h"
#include "component/ble.h"
#include "component/btzbsys.h"
#include "component/ccl.h"
#include "component/cfg.h"
#include "component/cmcc.h"
#include "component/cru.h"
#include "component/cvd.h"
#include "component/dac_ctrl.h"
#include "component/dgi_spi.h"
#include "component/dmac.h"
#include "component/dmt.h"
#include "component/dscon.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gpio.h"
#include "component/hmatrix2top.h"
#include "component/nvm.h"
#include "component/pac.h"
#include "component/pche.h"
#include "component/pfw.h"
#include "component/pmu.h"
#include "component/pps.h"
#include "component/qspi.h"
#include "component/ramecc.h"
#include "component/rcon.h"
#include "component/rot.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/silex.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/wdt.h"
#include "component/zigbee.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CX5109BZ31032 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adchs.h"
#include "instance/arb.h"
#include "instance/ble.h"
#include "instance/btzbsys.h"
#include "instance/ccl.h"
#include "instance/cfg.h"
#include "instance/cmcc.h"
#include "instance/cru.h"
#include "instance/cvd.h"
#include "instance/dac_ctrl.h"
#include "instance/dgi_spi.h"
#include "instance/dmac.h"
#include "instance/dmt.h"
#include "instance/dscon.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gpioa.h"
#include "instance/gpiob.h"
#include "instance/hmatrix2top.h"
#include "instance/nvm.h"
#include "instance/pac.h"
#include "instance/pche.h"
#include "instance/pfw.h"
#include "instance/pmu.h"
#include "instance/pps.h"
#include "instance/qspi.h"
#include "instance/ramecc.h"
#include "instance/rcon.h"
#include "instance/rot.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/silex.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tc4.h"
#include "instance/tc5.h"
#include "instance/tc6.h"
#include "instance/tc7.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/wdt.h"
#include "instance/zigbee.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CX5109BZ31032                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /* Peripheral Access Controller (PAC) */
#define ID_FREQM         (  1) /* Frequency Meter (FREQM) */
#define ID_EIC           (  2) /* External Interrupt Controller (EIC) */
#define ID_SERCOM0       (  3) /* Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       (  4) /* Serial Communication Interface (SERCOM1) */
#define ID_TC0           (  5) /* Basic Timer Counter (TC0) */
#define ID_TC1           (  6) /* Basic Timer Counter (TC1) */
#define ID_TC2           (  7) /* Basic Timer Counter (TC2) */
#define ID_TC3           (  8) /* Basic Timer Counter (TC3) */
#define ID_TC4           (  9) /* Basic Timer Counter (TC4) */
#define ID_TC5           ( 10) /* Basic Timer Counter (TC5) */
#define ID_TC6           ( 11) /* Basic Timer Counter (TC6) */
#define ID_TC7           ( 12) /* Basic Timer Counter (TC7) */
#define ID_TCC0          ( 13) /* Timer Counter Control (TCC0) */
#define ID_TCC1          ( 14) /* Timer Counter Control (TCC1) */
#define ID_TCC2          ( 15) /* Timer Counter Control (TCC2) */
#define ID_DSU           ( 32) /* Device Service Unit (DSU) */
#define ID_DMAC          ( 34) /* Direct Memory Access Controller (DMAC) */
#define ID_EVSYS         ( 35) /* Event System Interface (EVSYS) */
#define ID_RAMECC        ( 36) /* RAM ECC (RAMECC) */
#define ID_QSPI          ( 64) /* Quad SPI interface (QSPI) */
#define ID_CCL           ( 70) /* Configurable Custom Logic (CCL) */
#define ID_AC            ( 71) /* Analog Comparators (AC) */
#define ID_HMATRIX2TOP   ( 73) /* HSB Matrix (HMATRIX2TOP) */

#define ID_PERIPH_MAX    ( 73) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX5109BZ31032            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42001c00)                 /* AC Registers Address         */
#define ADCHS_REGS                       ((adchs_registers_t*)0x44001400)              /* ADCHS Registers Address      */
#define ARB_REGS                         ((arb_registers_t*)0x41011000)                /* ARB Registers Address        */
#define BLE_REGS                         ((ble_registers_t*)0x41012000)                /* BLE Registers Address        */
#define BTZBSYS_REGS                     ((btzbsys_registers_t*)0x41014000)            /* BTZBSYS Registers Address    */
#define CCL_REGS                         ((ccl_registers_t*)0x42001800)                /* CCL Registers Address        */
#define CFG_REGS                         ((cfg_registers_t*)0x44000000)                /* CFG Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x41002000)               /* CMCC Registers Address       */
#define CRU_REGS                         ((cru_registers_t*)0x44000a00)                /* CRU Registers Address        */
#define CVD_REGS                         ((cvd_registers_t*)0x44002400)                /* CVD Registers Address        */
#define DAC_CTRL_REGS                    ((dac_ctrl_registers_t*)0x44003c00)           /* DAC_CTRL Registers Address   */
#define DGI_SPI_REGS                     ((dgi_spi_registers_t*)0x44003e00)            /* DGI_SPI Registers Address    */
#define DMAC_REGS                        ((dmac_registers_t*)0x41004000)               /* DMAC Registers Address       */
#define DMT_REGS                         ((dmt_registers_t*)0x44000e00)                /* DMT Registers Address        */
#define DSCON_REGS                       ((dscon_registers_t*)0x42011000)              /* DSCON Registers Address      */
#define DSU_REGS                         ((dsu_registers_t*)0x41000000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40000800)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x41006000)              /* EVSYS Registers Address      */
#define FREQM_REGS                       ((freqm_registers_t*)0x40000400)              /* FREQM Registers Address      */
#define FUSES_DEVICECFG_REGS             ((fuses_devicecfg_registers_t*)0x00805e80)    /* FUSES Registers Address      */
#define GPIOA_REGS                       ((gpio_registers_t*)0x44002a00)               /* GPIOA Registers Address      */
#define GPIOB_REGS                       ((gpio_registers_t*)0x44002b00)               /* GPIOB Registers Address      */
#define HMATRIX2TOP_REGS                 ((hmatrix2top_registers_t*)0x42002400)        /* HMATRIX2TOP Registers Address */
#define NVM_REGS                         ((nvm_registers_t*)0x44000600)                /* NVM Registers Address        */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /* PAC Registers Address        */
#define PCHE_REGS                        ((pche_registers_t*)0x44012400)               /* PCHE Registers Address       */
#define PFW_REGS                         ((pfw_registers_t*)0x44000800)                /* PFW Registers Address        */
#define PMU_REGS                         ((pmu_registers_t*)0x44013e00)                /* PMU Registers Address        */
#define PPS_REGS                         ((pps_registers_t*)0x44001000)                /* PPS Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0x42000000)               /* QSPI Registers Address       */
#define RAMECC_REGS                      ((ramecc_registers_t*)0x41008000)             /* RAMECC Registers Address     */
#define RCON_REGS                        ((rcon_registers_t*)0x44000a00)               /* RCON Registers Address       */
#define ROT_REGS                         ((rot_registers_t*)0x44002c00)                /* ROT Registers Address        */
#define RTC_REGS                         ((rtc_registers_t*)0x42010000)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x40000c00)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x40001000)             /* SERCOM1 Registers Address    */
#define SILEX_REGS                       ((silex_registers_t*)0x43000000)              /* SILEX Registers Address      */
#define TC0_REGS                         ((tc_registers_t*)0x40001400)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40001800)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40001c00)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40002000)                 /* TC3 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x40002400)                 /* TC4 Registers Address        */
#define TC5_REGS                         ((tc_registers_t*)0x40002800)                 /* TC5 Registers Address        */
#define TC6_REGS                         ((tc_registers_t*)0x40002c00)                 /* TC6 Registers Address        */
#define TC7_REGS                         ((tc_registers_t*)0x40003000)                 /* TC7 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x40003400)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x40003800)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x40003c00)                /* TCC2 Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x44000500)                /* WDT Registers Address        */
#define ZIGBEE_REGS                      ((zigbee_registers_t*)0x41010000)             /* ZIGBEE Registers Address     */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CX5109BZ31032                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x42001c00)                          /* AC Base Address */
#define ADCHS_BASE_ADDRESS               _UINT32_(0x44001400)                          /* ADCHS Base Address */
#define ARB_BASE_ADDRESS                 _UINT32_(0x41011000)                          /* ARB Base Address */
#define BLE_BASE_ADDRESS                 _UINT32_(0x41012000)                          /* BLE Base Address */
#define BTZBSYS_BASE_ADDRESS             _UINT32_(0x41014000)                          /* BTZBSYS Base Address */
#define CCL_BASE_ADDRESS                 _UINT32_(0x42001800)                          /* CCL Base Address */
#define CFG_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* CFG Base Address */
#define CMCC_BASE_ADDRESS                _UINT32_(0x41002000)                          /* CMCC Base Address */
#define CRU_BASE_ADDRESS                 _UINT32_(0x44000a00)                          /* CRU Base Address */
#define CVD_BASE_ADDRESS                 _UINT32_(0x44002400)                          /* CVD Base Address */
#define DAC_CTRL_BASE_ADDRESS            _UINT32_(0x44003c00)                          /* DAC_CTRL Base Address */
#define DGI_SPI_BASE_ADDRESS             _UINT32_(0x44003e00)                          /* DGI_SPI Base Address */
#define DMAC_BASE_ADDRESS                _UINT32_(0x41004000)                          /* DMAC Base Address */
#define DMT_BASE_ADDRESS                 _UINT32_(0x44000e00)                          /* DMT Base Address */
#define DSCON_BASE_ADDRESS               _UINT32_(0x42011000)                          /* DSCON Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x41000000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x40000800)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x41006000)                          /* EVSYS Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x40000400)                          /* FREQM Base Address */
#define FUSES_DEVICECFG_BASE_ADDRESS     _UINT32_(0x00805e80)                          /* FUSES Base Address */
#define GPIOA_BASE_ADDRESS               _UINT32_(0x44002a00)                          /* GPIOA Base Address */
#define GPIOB_BASE_ADDRESS               _UINT32_(0x44002b00)                          /* GPIOB Base Address */
#define HMATRIX2TOP_BASE_ADDRESS         _UINT32_(0x42002400)                          /* HMATRIX2TOP Base Address */
#define NVM_BASE_ADDRESS                 _UINT32_(0x44000600)                          /* NVM Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x40000000)                          /* PAC Base Address */
#define PCHE_BASE_ADDRESS                _UINT32_(0x44012400)                          /* PCHE Base Address */
#define PFW_BASE_ADDRESS                 _UINT32_(0x44000800)                          /* PFW Base Address */
#define PMU_BASE_ADDRESS                 _UINT32_(0x44013e00)                          /* PMU Base Address */
#define PPS_BASE_ADDRESS                 _UINT32_(0x44001000)                          /* PPS Base Address */
#define QSPI_BASE_ADDRESS                _UINT32_(0x42000000)                          /* QSPI Base Address */
#define RAMECC_BASE_ADDRESS              _UINT32_(0x41008000)                          /* RAMECC Base Address */
#define RCON_BASE_ADDRESS                _UINT32_(0x44000a00)                          /* RCON Base Address */
#define ROT_BASE_ADDRESS                 _UINT32_(0x44002c00)                          /* ROT Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x42010000)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x40000c00)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x40001000)                          /* SERCOM1 Base Address */
#define SILEX_BASE_ADDRESS               _UINT32_(0x43000000)                          /* SILEX Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x40001400)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x40001800)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x40001c00)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x40002000)                          /* TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UINT32_(0x40002400)                          /* TC4 Base Address */
#define TC5_BASE_ADDRESS                 _UINT32_(0x40002800)                          /* TC5 Base Address */
#define TC6_BASE_ADDRESS                 _UINT32_(0x40002c00)                          /* TC6 Base Address */
#define TC7_BASE_ADDRESS                 _UINT32_(0x40003000)                          /* TC7 Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x40003400)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x40003800)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x40003c00)                          /* TCC2 Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x44000500)                          /* WDT Base Address */
#define ZIGBEE_BASE_ADDRESS              _UINT32_(0x41010000)                          /* ZIGBEE Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CX5109BZ31032                                   */
/* ************************************************************************** */
#include "pio/pic32cx5109bz31032.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CX5109BZ31032                        */
/* ************************************************************************** */
#define ROM_SECURE_BOOT_ROM_SIZE       _UINT32_(0x00010000)    /*   64kB Memory segment type: rom */
#define ROM_SECURE_BOOT_PATCH_SIZE     _UINT32_(0x00000800)    /*    2kB Memory segment type: rom */
#define FCR_PFM_SIZE                   _UINT32_(0x00080000)    /*  512kB Memory segment type: flash */
#define FCR_PFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_PFM_NB_OF_PAGES            _UINT32_(       128)

#define FCR_BFM_SIZE                   _UINT32_(0x00005000)    /*   20kB Memory segment type: flash */
#define FCR_BFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_BFM_NB_OF_PAGES            _UINT32_(         5)

#define FCR_CFM_SIZE                   _UINT32_(0x00001000)    /*    4kB Memory segment type: fuses */
#define FCR_CFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_CFM_NB_OF_PAGES            _UINT32_(         1)

